[
    {
        "date": "2018-PRESENT",
        "title": "Designer, Developer, Analyst, Merchant",
        "company": "CTW Home Collection",
        "description": "Design and develop user interface, digital marketing graphics and email campaigns. Create web content for business-to-business wholesale website including image selection and copy writing. Utilize Google Analytics within the e-commerce platform. Design annual product catalog and bi-weekly promotional fliers for home décor business."
    },
    {
        "date": "2016-PRESENT",
        "title": "Operations Manager and Marketing Manager",
        "company": "Clover Trails Farm",
        "description": "Oversee day-to-day operations and animal maintenance of agri-tourism farm. Develop print and web marketing materials to promote educational farm activities which include summer camp session."
    },
    {
        "date": "2008-2018",
        "title": "UX/UI Design Manager, Sr. Web Designer, Digital Design Director, E-commerce Art Director",
        "company": "Performance, Inc.",
        "description": "Lead and drive strategic User Interface (UI) and web design for multiple cycling websites that consistently rank within the Internet Retailer Top 500. Responsible for establishing creative direction of online services, products and programs. Utilize data from consumer buying habits and site statistics to develop strong sales driving promotions. Provide user experience strategy, visual and interaction design leadership, and user-centered design methodologies to deliver measurable satisfaction, performance improvements and increased e-commerce conversion. Initiate user research, investigate emerging technologies, and incorporate design innovations to deliver a rich, intuitive and engaging experience to approximately 1,500,000 unique visitors per month. Design and maintain wire frames and User Interface (UI) for websites and emails. Collaborate with marketing team, onshore/offshore web developers, and outside agencies to improve functionality, user experience and sales conversion. Received Silver designation in 25th Annual Multichannel Merchant Awards for Best Sporting Goods/Hobbies Website. Completed Performance, Inc. Leadership-Management Development Certification."
    }
]